Section2/OpenFoam/ScalingTests/StrongScalingTest/case/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1e-8 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (7.72 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }
    "(wall_hor|wall_ver|wall_in)"
    {
        type            noSlip;
    }
    top
    {
        type            symmetryPlane;
    }

    "(front|back)"
    {
        type            cyclic;
    }
}

